const resultData = [
  {
    id: 1,
    text: {
      results: [
        {
          id: 1,
          activityId: 1,
          text: 'DIY 작품 완성하기',
          detail: 'DIY(Do It Yourself)를 아시나요? DIY는 반제품 상태의 제품을 구매하여 소비자가 원하는 물건을 직접 만들 수 있도록 한 상품이에요! 많은 사람들이 실내에 있는 시간이 늘어나면서 명화 그리기, 보석 십자수, 스크래치 페이퍼 등 다양한 DIY 제품이 출시되었어요. 시간 가는 줄 모르고 하다 보면 어느새 멋진 작품이 완성되어 있을 거예요~',
          intro: [
            {
              id: 1, text: '컬러링북 색칠하기',
            },
            {
              id: 2, text: '양모 펠트 인형 만들기',
            },
          ],
        },
        {
          id: 2,
          activityId: 2,
          text: '블로그 운영하기',
          detail: '한 분야에 전문성이 있거나 관심을 갖고 있는 분야가 있나요? 블로그 운영을 하면 내가 원하는 주제로 다양한 글을 작성할 수 있어요. 비슷한 관심사를 가지고 있는 사람들과 소통하는 재미도 느낄 수 있어요. 블로그를 통해 수익을 낼 수 있다고도 해요! 저도 블로그가 있지만 일상적인 글을 작성하는 용도로 운영하고 있어요. 저의 티스토리 블로그 구독해 주세요! 😁',
          intro: [
            {
              id: 1, text: '카페 활동하기',
            },
            {
              id: 2, text: '브런치 작성하기',
            },
          ],
        },
        {
          id: 3,
          activityId: 3,
          text: '캘리그래피 배우기',
          detail: '캘리그래피는 취미로 도전하기에 매우 추천하는 비타민이에요! 종이와 펜만 가지고 가볍게 시도할 수 있죠. 여러분은 마음속에 새기고 싶은 글귀가 있나요? 내가 원하는 문구를 멋지게 적어보세요. 아름다운 글씨로 쓴 글은 마음에도 더 오래 남아요. 아이패드가 있다면 디지털 캘리그래피를 배워보시는 건 어떠세요?',
          intro: [
            {
              id: 1, text: '붓글씨 배우기',
            },
            {
              id: 2, text: '필사하기',
            },
          ],
        },
        {
          id: 4,
          activityId: 4,
          text: '요가하기',
          detail: '요가는 자세와 호흡을 가다듬고 심신을 수련하는 수행법이에요. 요가를 하면 심신의 안정을 취할 수 있고 유연성과 신체기능을 개선하는 데에도 도움이 되어요. ☺ 요가는 비교적 활동성이 적기 때문에 학원에서 배울 수도 있고 집에서 혼자 시작할 수도 있어요. 기구를 이용해 몸을 교정하고 싶으시다면 필라테스를 추천드려요! 바쁜 일상에서 잠시 벗어나 마음의 여유를 되찾는 비타민 한 알을 먹어보세요.',
          intro: [
            {
              id: 1, text: '명상하기',
            },
            {
              id: 2, text: '필라테스하기',
            },
          ],
        },
        {
          id: 5,
          activityId: 5,
          text: '인테리어 바꾸기',
          detail: '인테리어가 잘 되어있는 집을 보다 보면 집을 예쁘게 꾸미고 싶다는 생각이 들어요. 구경하는 것도 이렇게 재밌는데 내 집이 달라진다면 얼마나 좋을까요? 인테리어를 많이 바꾸기 부담스럽다면 방의 구조를 바꿔보세요! 가구의 위치만 바뀌어도 분위기 전환이 된답니다. 또 쓰지 않는 물건을 미련 없이 버릴 수 있는 용기도 필요해요.',
          intro: [
            {
              id: 1, text: '방 구조 바꾸기',
            },
            {
              id: 2, text: '이불 바꾸기',
            },
          ],
        },
        {
          id: 6,
          activityId: 6,
          text: '외국어 배우기',
          detail: '새로운 언어를 배우는 것은 정말 매력적이에요. 세상에서 나와 대화할 수 있는 대상이 많아지는 것이잖아요. 여행을 갔을 때 좋았던 나라가 있나요? 여행을 가보고 싶은 나라가 있나요? 좋아하는 나라의 언어는 더 흥미롭게 배울 수 있을 거예요. 요즘은 강의와 학습지가 많아서 꼭 외국에서 배우지 않더라도 새로운 언어를 배울 수 있답니다. 취미이면서 강점이 될 수 있는 외국어 배우기. 길게 보고 천천히 시작해보세요!',
          intro: [
            {
              id: 1, text: '영어 공부하기',
            },
            {
              id: 2, text: '수화 배우기',
            },
          ],
        },
      ],
    },
  },
  {
    id: 2,
    text: {
      results: [
        {
          id: 1,
          activityId: 7,
          text: '가족들과 대화하기',
          detail: '가족들과 함께 사시나요? 밤에 과일을 먹으면서 가족들과 대화해보세요. 가족들은 요즘 어떻게 살고 있을까요? 기쁜 일 슬픈 일 모두 털어놔보세요. 가족들과의 대화는 소중하지만 바쁘게 살다 보면 잊기 쉬운 시간이에요. 가족들과 떨어져 산다면 오늘 저녁 전화 한 통을 해보세요. 가족들도 기다리고 있을 거예요. 😊',
          intro: [
            {
              id: 1, text: '전화하기',
            },
            {
              id: 2, text: '친구들과 대화하기',
            },
          ],
        },
        {
          id: 2,
          activityId: 8,
          text: '사진첩 구경하기',
          detail: '사진첩 속에는 지난 추억도 있고 앞으로의 이야기도 있어요. 집 밖을 나갈 수 없는 때에 사진첩을 구경하면 정말 재밌어요! 친구들과 함께 찍은 사진을 공유해보세요. 떠났던 여행을 다시 보며 그때의 추억도 떠올려보세요! 아 이때는 어떤 일이 있었지~ 기억이 새록새록 나면서 행복한 시간을 보낼 수 있을 거예요.',
          intro: [
            {
              id: 1, text: '사진 정리하기',
            },
            {
              id: 2, text: '어린시절 앨범 보기',
            },
          ],
        },
        {
          id: 3,
          activityId: 9,
          text: '편지쓰기',
          detail: '소중한 사람들에게 말하지 못했던 이야기가 있나요? 직접 얼굴을 마주하고 이야기하기 쑥스럽다면 편지를 써보세요. 편지는 말보다 진한 감동이 있어요. 편지를 쓰는 동안 그 사람을 생각하게 되고 편지로 전한 말은 오랫동안 남아있죠. 편지를 받는 사람도 읽는 동안 당신을 생각하게 될 거예요. 군인 친구들에게는 꼭 써주세요!',
          intro: [
            {
              id: 1, text: '시 쓰기',
            },
            {
              id: 2, text: '문자 보내기',
            },
          ],
        },
        {
          id: 4,
          activityId: 10,
          text: '밤 산책하고 야경 보기',
          detail: '날씨가 좋은 밤에 걸어보세요. 좋아하는 음악을 들으며 밤공기를 느껴보세요. 높은 건물에 올라가 야경을 보는 것도 재밌을 거예요. 혼자서 무섭다면 친구나 연인과 같이 야경을 보러 가보세요. 주변에 익숙하던 건물과 풍경도 밤이 되면 새롭게 다가올 거예요. 북악스카이웨이나 남산을 밤에 가보시는 것을 추천드려요.',
          intro: [
            {
              id: 1, text: '밤바다 보러 가기',
            },
            {
              id: 2, text: '전망대 올라가기',
            },
          ],
        },
        {
          id: 5,
          activityId: 11,
          text: '샤워하고 마스크팩하기',
          detail: '힘든 하루의 끝, 달콤한 휴식 같은 비타민이 뭐가 있을까요? 저는 샤워하고 마스크팩을 하는 것을 추천드려요. 오늘 할 일을 모두 마치고 나에게 선물을 줘보세요. 마스크팩을 하면 피부관리도 되고 기분도 좋아지고 일석이조예요! (19) 시원한 맥주 한 캔도 빼놓을 수 없죠! 이게 바로 인생 아니겠어요~',
          intro: [
            {
              id: 1, text: '족욕하기',
            },
            {
              id: 2, text: '맥주 한 캔 마시기',
            },
          ],
        },
        {
          id: 6,
          activityId: 12,
          text: '영화 보기',
          detail: '영화 보기는 쉬고 싶은 주말에도 부담 없이 즐길 수 있는 비타민이에요. 요즘은 OTT 서비스가 많아서 언제 어디서든 저렴하게 영화를 볼 수 있어요! 집에서 보는 영화도 좋지만 영화관에서만 느낄 수 있는 재미도 있죠. 대형 스크린과 웅장한 사운드, 팝콘까지! 차를 가지고 계시다면 날씨 좋은 날 자동차 극장에 가보시는 건 어떠세요? 😁',
          intro: [
            {
              id: 1, text: '드라마 보기',
            },
            {
              id: 2, text: '자동차 극장 가기',
            },
          ],
        },
      ],
    },
  },
  {
    id: 3,
    text: {
      results: [
        {
          id: 1,
          activityId: 13,
          text: '요리 만들어서 대접하기',
          detail: '요리를 좋아하시나요? 요리는 자기가 먹는 것보다 다른 사람들이 먹는 걸 볼 때 더 매력 있는 취미인 것 같아요. 요리를 잘 하지 못하신다면 쉬운 음식부터 도전해보세요! 어려운 요리가 꼭 더 맛있는 것도 아니고 요리는 많이 하다 보면 늘거든요! 가족과 친구들에게 대접해보세요. 분명 좋아할 거예요. 그리고 다음에 저한테도 해주세요 😋',
          intro: [
            {
              id: 1, text: '베이킹해서 선물하기',
            },
            {
              id: 2, text: '홈파티하기',
            },
          ],
        },
        {
          id: 2,
          activityId: 14,
          text: '독서모임 가기',
          detail: '올해 목표에 독서하기가 있으시다면 독서모임을 추천드려요! 책을 좋아하신다면 혼자 읽어도 재밌지만 책을 읽어야지 다짐만 하고 매번 실패하신다면 독서모임이 답일 거예요~ 책을 읽고 다른 사람들과 생각을 공유할 수도 있고 주어진 기간 동안 책을 다 읽어야 하니 꾸준하게 읽게 된답니다! 독서모임에서 새로운 사람들을 만나보세요.',
          intro: [
            {
              id: 1, text: '스터디 참여하기',
            },
            {
              id: 2, text: '북클럽 가입하기',
            },
          ],
        },
        {
          id: 3,
          activityId: 15,
          text: '마술 배우기',
          detail: '마술에 관심이 있으신가요? 마술에는 시간과 장소에 상관없이 자주 연습할 수 있는 마술들이 있어요. 저는 동전이나 카드로 할 수 있는 마술들을 추천해드리고 싶어요. 도구 하나만 있으면 할 수 있는 마술에도 여러 가지가 있어요. 열심히 연습해서 주변 사람들에게 짜잔! 하고 보여주면 다들 즐거워할 거예요~',
          intro: [
            {
              id: 1, text: '풍선아트 배우기',
            },
            {
              id: 2, text: '저글링 배우기',
            },
          ],
        },
        {
          id: 4,
          activityId: 16,
          text: '머리 바꾸기',
          detail: '기분 전환으로 머리를 새롭게 바꿔보시는 것은 어떠세요? 생각보다 어울릴 수도 있어요. 평소에 하지 않던 스타일도 괜찮아요. 머리를 바꾸면 새로운 자신의 모습도 발견할 수 있어요. 물론 익숙한 나도 좋지만 가끔은 변화를 원하고 있을 수도 있잖아요? 자신에게 새로운 모습을 선물해보세요. 주변 사람들이 멋있다고 생각할 거예요!',
          intro: [
            {
              id: 1, text: '머리 염색하기',
            },
            {
              id: 2, text: '네일아트하기',
            },
          ],
        },
        {
          id: 5,
          activityId: 17,
          text: '오락실 가기',
          detail: '지금 오락실에 가보세요! 재미있는 게임들이 많아요. 다양한 게임들을 시도해보세요. 꼭 게임을 하지 않고 구경만 해도 재밌어요. 스포츠를 좋아하시면 농구와 사격, 혼자서도 즐기고 싶으시면 리듬게임, 격투게임을 해보세요! 컴퓨터로 하는 게임과는 또 다른 매력을 느끼실 수 있을 거예요! 다음에 저랑 같이 가요 😎',
          intro: [
            {
              id: 1, text: '사격장 가기',
            },
            {
              id: 2, text: 'PC방 가기',
            },
          ],
        },
        {
          id: 6,
          activityId: 18,
          text: '공연보러가기',
          detail: '문화생활의 대표주자 공연! 다양한 종류의 공연이 있는 만큼 취향에 맞는 공연을 골라서 즐겨보세요. 나를 불태우고 싶다면 콘서트를 추천해요. 좋아하는 가수들을 실제로 보는 것은 덤이죠! 이야기를 듣고 싶다면 뮤지컬이나 연극을, 음악을 느끼고 싶으시면 오케스트라 연주를 들어보세요. 삶을 풍요롭게 만들어주는 문화생활을 잊지 말고 즐겨보세요! 😁',
          intro: [
            {
              id: 1, text: '경기 직관하기',
            },
            {
              id: 2, text: 'TV 프로그램 방청 가기',
            },
          ],
        },
      ],
    },
  },
  {
    id: 4,
    text: {
      results: [
        {
          id: 1,
          activityId: 19,
          text: '자전거 타기',
          detail: '따릉따릉~ 자전거 좋아하시나요? 따릉이를 이용해보세요! 편하게 서울시내를 돌아다녀 보실 수 있어요. 친구들과 한강을 따라서 바람을 맞으며 자전거를 타고요. 잠깐 쉬었다 갈까? 한강 근처 편의점 앞에 앉아서 대화를 하는 거예요. 상상만 해도 즐겁지 않나요? 산책과는 다른 매력이 있어요.',
          intro: [
            {
              id: 1, text: '킥보드 타기',
            },
            {
              id: 2, text: '드라이브 가기',
            },
          ],
        },
        {
          id: 2,
          activityId: 20,
          text: '칭찬하기',
          detail: '칭찬을 해보세요. 나에게도 좋고 다른 사람에게도 좋아요. 평소에 부끄러워서 칭찬을 잘 하지 못했다면 용기를 내보세요! 칭찬을 싫어하는 사람은 없어요. 하는 사람도 받는 사람도 기분이 좋아지는 칭찬은 복용 제한이 없답니다! 나에게 하는 칭찬도 잊지 마세요. 칭찬을 자주 하시면 그 칭찬이 나에게도 돌아올 거예요. 그런 김에 저도 칭찬 하나 할게요! 오늘도 잘 하셨어요! 😆',
          intro: [
            {
              id: 1, text: '감사일기 쓰기',
            },
            {
              id: 2, text: '선물로 마음 전하기',
            },
          ],
        },
        {
          id: 3,
          activityId: 21,
          text: '등산하기',
          detail: '날씨가 좋은 날엔 산에 가보시는 것은 어떤가요? 우리나라의 장점은 도시에도  아름다운 산들이 많이 있다는 거예요! 😊 매번 도시 속에 있다가 산위에 올라가 보시면 신선한 공기와 탁 트인 전망이 기다리고 있어요. 간단한 간식과 함께라면 분명히 좋아하실 거예요. 높은 산이 부담스러우시다면 가볍게 둘레길을 걸어보세요.',
          intro: [
            {
              id: 1, text: '둘레길 걷기',
            },
            {
              id: 2, text: '트래킹 가기',
            },
          ],
        },
        {
          id: 4,
          activityId: 22,
          text: '풍경 그리기',
          detail: '벚꽃이 만개한 길가, 단풍과 노랗게 물들은 저녁노을, 잔잔한 울림을 주는 바닷가. 우리는 살면서 아름다운 풍경들을 만나게 되죠. 사진으로 담기에는 아쉬울 정도로요. 그 풍경을 그림으로 그린다면 기억이 더 오래 남을 거예요. 그때의 기분과 감동을 그림으로 남겨보세요. 꼭 잘 그릴 필요가 있나요?',
          intro: [
            {
              id: 1, text: '동물 그리기',
            },
            {
              id: 2, text: '펜드로잉 하기',
            },
          ],
        },
        {
          id: 5,
          activityId: 23,
          text: '방 청소하기',
          detail: '‘성공하고 싶으면 이불 정리부터 해라’라는 말을 아시나요? 정리는 정말 중요해요. 방을 정리하면 같이 마음도 정리될 거예요. 창문을 열고 환기도 시켜보세요. 청소를 하다 보면 신기하고 추억이 있던 물건들을 발견할 수도 있어요. 그리고 인생에서 정말 좋은 습관까지 생기는 거죠! 주기적으로 방 청소를 하는 것을 추천해요!',
          intro: [
            {
              id: 1, text: '책상 정리하기',
            },
            {
              id: 2, text: '빨래하기',
            },
          ],
        },
        {
          id: 6,
          activityId: 24,
          text: '러닝하기',
          detail: "LET'S RUN! 죽을 것처럼 힘들게 달려보세요. 그렇게 달리다 멈추면 스트레스가 다 날아갈 거예요. 가벼운 러닝도 좋아요. 혼자서 달리기 힘드시면 러닝 동아리나 동호회에 가입해보세요. 사람들과 같이 달리면 더 재미있답니다. 😁 나이키 러닝 클럽을 활용하는 것을 추천해요. 실력이 늘면 짧은 마라톤을 나가서 성취감을 느껴보세요.",
          intro: [
            {
              id: 1, text: '마라톤 참가하기',
            },
            {
              id: 2, text: '산책하기',
            },
          ],
        },
      ],
    },
  },
  {
    id: 5,
    text: {
      results: [
        {
          id: 1,
          activityId: 25,
          text: '작곡하기',
          detail: '나만의 음악을 만들고 싶다는 생각이 드신 적 있나요? 음악을 즐기는 사람들은 꼭 한 번씩은 드는 생각이죠. 그럼 시작해보세요. 기초적인 음악 이론과 화성학을 배운다면 취미로도 즐길 수 있어요. 처음이라면 GarageBand를 추천해드릴게요. 경험이 좀 있다고요? 그러면 LogicPro로 시작해보세요. 나중에 잘 만드시면 들려주세요! 😆',
          intro: [
            {
              id: 1, text: '비트메이킹',
            },
            {
              id: 2, text: '노래 부르기',
            },
          ],
        },
        {
          id: 2,
          activityId: 26,
          text: '아이패드 드로잉 하기',
          detail: '그림 그리기는 생각보다 어렵지 않아요! 종이와 펜만 있다면 내가 원하는 것을 무엇이든 그릴 수 있답니다. 요즘은 디지털 드로잉으로 쉽게 그림을 그릴 수 있어서 아이패드 드로잉을 추천하고 싶어요. 강의도 엄청 많거든요! 아이패드가 없다고요? 괜찮아요! 더 저렴한 태블릿을 사용해보세요. 나만의 그림과 이모티콘을 그려보세요',
          intro: [
            {
              id: 1, text: '오일파스텔화 그리기',
            },
            {
              id: 2, text: '색연필화 그리기',
            },
          ],
        },
        {
          id: 3,
          activityId: 27,
          text: '미니어처 만들기',
          detail: '꼼지락 꼼지락거리는 거 좋아하시는 분! 조그만 것만 보면 귀여워서 어쩔 줄 모르겠는 분! 이제 여러분들이 미니어처를 만드실 차례예요! 😊 내 손안의 작은 세상을 만들어보세요. 미니어처 만들기는 나이에 상관없이 즐길 수 있는 취미예요. 약간의 손재주가 필요하지만 미니어처를 만들면서 섬세함을 길러보세요!',
          intro: [
            {
              id: 1, text: 'DIY 미니어처 하우스 만들기',
            },
            {
              id: 2, text: '미니어처 음식 만들기',
            },
          ],
        },
        {
          id: 4,
          activityId: 28,
          text: '책 출판하기',
          detail: '자신만의 생각과 지식을 글로 정리해보신 적이 있나요? 그 글을 다른 사람들에게 공유하고 싶었던 적이 있으신가요? 글을 쓰는 사람들에게는 책을 출판하는 것이 버킷리스트에 있을 거라고 생각해요. 꼭 어려운 글만 출판할 수 있는 건 아니에요. 지식을 공유하고 싶다면 PDF 전자책을 출간해보세요. 1인 출판사도 있고 디지털 출판도 있어요. 여러분만의 책을 남겨보세요!',
          intro: [
            {
              id: 1, text: '에세이 쓰기',
            },
            {
              id: 2, text: '강의 개설하기',
            },
          ],
        },
        {
          id: 5,
          activityId: 29,
          text: '홈가드닝 시작하기',
          detail: '식물은 공기 정화와 습도 관리에 많은 도움이 되어요. 집이 넓지 않아도 작은 식물들로 예쁜 홈가드닝을 즐길 수 있답니다! 특히 대파는 하루하루 크는 게 눈에 보일 만큼 빨리 자라서 집에서 대파를 키우는 게 유행이라고 해요. 채소를 직접 길러서 먹으면 환경에도 도움이 되어요~ 작은 다육식물부터 멋있는 난까지 한 번 키워보세요! 😎',
          intro: [
            {
              id: 1, text: '채소 길러서 먹기',
            },
            {
              id: 2, text: '텃밭 가꾸기',
            },
          ],
        },
        {
          id: 6,
          activityId: 30,
          text: '자격증 공부하기',
          detail: '세상에는 다양한 자격증이 있죠. 사람들은 자격증 하면 흔히 공부와 관련된 자격증만 생각하는데요. 이런 자격증도 있어? 하는 자격증들도 많답니다. 평소에 흥미가 있는 주제가 있다면 자격증이 있는지 찾아보세요! 그리고 여러분의 흥미를 증명할 수 있는 자격증을 취득해보세요! 나를 표현하는 또 하나의 방법이 되는 거예요~ 😁',
          intro: [
            {
              id: 1, text: '교육 듣기',
            },
            {
              id: 2, text: '타로 배우기',
            },
          ],
        },
      ],
    },
  },
  {
    id: 6,
    text: {
      results: [
        {
          id: 1,
          activityId: 31,
          text: '좋아하는 것 수집하기',
          detail: '여러분은 좋아하는 것을 수집하는 취미가 있나요? 좋아하는 것 자체가 비타민이기도 하지만 그 물품을 수집하는 것도 하나의 비타민이죠~ 우표, 화폐, 레고 등 사람들끼리 자신이 수집한 물품을 공유하는 재미도 있어요! 좋아하는 가수의 굿즈를 모으는 것도 수집이라고 할 수 있겠네요~ 저는 스티커랑 다른 나라의 언어로 된 퍼즐책을 수집해요. 외국에 가면 꼭 서점에 들르는 이유이기도 해요 😊',
          intro: [
            {
              id: 1, text: '음반 구매하기',
            },
            {
              id: 2, text: '플레이리스트 만들기',
            },
          ],
        },
        {
          id: 2,
          activityId: 32,
          text: '홈 카페 만들기',
          detail: '집 근처 카페에 가는 것도 쉽지 않을 때 집을 카페처럼 꾸며보시는 것은 어떠세요? 요즘은 제품들이 잘 만들어져서 집에서 만들기 쉬운 달고나 커피, 죠리퐁 라테 같은 것들도 있어요. 좋아하는 친구들을 초대해서 만들어주세요. 그리고 즐거운 나의 집을 SNS에 공유도 해보세요. 멋진 집도 갖고 추억도 생기고 아주 좋은걸요!',
          intro: [
            {
              id: 1, text: '과일청 담그기',
            },
            {
              id: 2, text: '디저트 만들기',
            },
          ],
        },
        {
          id: 3,
          activityId: 33,
          text: '공예품 만들어서 선물하기',
          detail: '공예품을 만들어보신 경험이 있나요? 가죽공예, 나무공예, 비즈공예 등 종류가 다양해요. 저는 최근에 키 링을 만들어 주변 사람들에게 선물했는데 만드는 재미에 선물하는 기쁨까지 있어서 추천해요. ☺️ 전문적으로 공예를 배우는 것도 좋고 취미로 간단하게 즐길 수도 있어요! 짧은 시간에 공예품을 완성하고 싶다면 원 데이 클래스에 참여해보세요~',
          intro: [
            {
              id: 1, text: '원데이 클래스 참여하기',
            },
            {
              id: 2, text: '3D펜으로 그리기',
            },
          ],
        },
        {
          id: 4,
          activityId: 34,
          text: '인터넷 쇼핑하기',
          detail: '이 비타민은 복용에 주의하세요. 중독성도 심하고 통장의 건강을 해칠 수 있거든요. 아이쇼핑도 정말 재밌어요. 아이쇼핑으로 끝나지 않을 가능성이 있다는 것이 문제이죠.. 하지만 인터넷 쇼핑만큼 설렘을 주는 비타민이 또 있을까요? 택배 때문에 집에 빨리 가고 싶었던 적 다들 있으시죠? 뭐든지 적당히 즐기면 괜찮아요!',
          intro: [
            {
              id: 1, text: '아이쇼핑하기',
            },
            {
              id: 2, text: '마트 구경하기',
            },
          ],
        },
        {
          id: 5,
          activityId: 35,
          text: '템플스테이가기',
          detail: '문명에 둘러싸여 살다 보면 가끔 중요한 것을 잊기 마련이에요. 템플스테이를 가면 고요한 자연 속에 마음의 여유를 되찾을 수 있어요. 😊 이건 제 개인적인 견해이지만 템플스테이를 가시면 매우 놀라실 거예요. 고기가 없어도 밥이 이렇게 맛있다고? 꼭 불교신자가 아니어도 템플스테이는 경험해볼 만한 비타민이에요. 자연과 함께 힐링 그 자체인 하루를 보내보세요!',
          intro: [
            {
              id: 1, text: '낚시하기',
            },
            {
              id: 2, text: '아쿠아리움 가기',
            },
          ],
        },
        {
          id: 6,
          activityId: 36,
          text: '먹고 싶은 음식 배달시켜먹기',
          detail: '먹는 건 언제나 즐거워요! 맛있는 음식으로 스트레스를 한 방에 날려보세요. 부담이 되지 않다면 평소에 먹고 싶은 음식을 주문해보세요. 매운 것부터 달콤한 것까지 세상엔 맛있는 음식이 너무 많아요. 살이 찌는 것이 걱정되신다면 맛있게 먹고 신나게 운동을 하러 가보아요! 저만 먹기 위해 사는 건 아니죠?',
          intro: [
            {
              id: 1, text: '맛집 탐방하기',
            },
            {
              id: 2, text: '먹고 싶은 음식 포장해와서 먹기',
            },
          ],
        },
      ],
    },
  },
  {
    id: 7,
    text: {
      results: [
        {
          id: 1,
          activityId: 37,
          text: '새로운 악기 배우기',
          detail: '새로운 악기를 배워보세요. 악기 연주는 두뇌 활동에도 도움이 되고 우리의 삶을 행복하게 해줘요. 처음부터 잘 다룰 수는 없겠지만 그 속에서 즐거움을 찾고 열정을 쏟는 자신을 발견할 수 있을 거예요! 학창 시절 리코더를 연주했던 기억을 떠올려서 다양한 악기를 배워보세요. 일렉기타나 드럼 패드 같은 생소한 악기도 좋고요. 집에서 하모니카나 칼림바 같은 가벼운 악기로도 도전해보세요. 저는 요즘 바이올린을 배우고 있어요. 오케스트라 공연에 참여하는 것이 목표예요. 제 공연에 와주실 거죠? 😁',
          intro: [
            {
              id: 1, text: '기타 배우기',
            },
            {
              id: 2, text: '공연하기',
            },
          ],
        },
        {
          id: 2,
          activityId: 38,
          text: '스쿠버다이빙하기',
          detail: '새로운 세상에 눈을 떠보세요. 물속에서 눈을 뜨면 황홀한 풍경에 압도되실 거예요. 수영을 못해도 스쿠버다이빙을 할 수 있어요. 처음에는 무서울 수 있지만 한 번만 들어가면 또 들어가고 싶어질 거예요! 국내에도 스쿠버다이빙 강습을 하는 곳들이 많아요. 열심히 배우면 자격증도 딸 수 있으니 도전해보세요!',
          intro: [
            {
              id: 1, text: '서핑하기',
            },
            {
              id: 2, text: '패러글라이딩 체험하기',
            },
          ],
        },
        {
          id: 3,
          activityId: 39,
          text: '댄스 배우기',
          detail: '춤을 배워보세요. 스트레스가 다 날아갈 거예요! 춤을 잘 못추신다면 처음에는 창피할 수 있지만 점점 즐기면 잘추게 되고 나중에는 푹 빠지시게 될 거예요. 또한 춤에도 발레, 힙합, 국악 무용 등 다양한 분야들이 있어요. 원하시는 분야에 도전해보세요. 요즘에는 유튜브에도 댄스를 알려주는 유튜버들이 많아요. 한 번 잘 맞는지 미리 확인해보시는 것도 좋을 것 같네요! 😎',
          intro: [
            {
              id: 1, text: '발레 배우기',
            },
            {
              id: 2, text: '보드 타기',
            },
          ],
        },
        {
          id: 4,
          activityId: 40,
          text: '드론 날리기',
          detail: '드론을 날려보세요! 드론은 생각보다 비싸지 않아요. 그리고 스마트폰으로 조종할 수 있는 드론들도 많아요. 드론을 조종하는 것도 즐겁지만 영상을 촬영해서 나오는 결과물로도 재미를 느낄 수도 있어요. 드론은 주의할 점이 많아요.기종에 따라 필요한 자격증이 다르니 잘 확인하셔야 하고 비행 금지구역이 아닌지 확인하고 드론을 날려야 해요!',
          intro: [
            {
              id: 1, text: 'RC카 주행하기',
            },
            {
              id: 2, text: '아두이노 키트 사용하기',
            },
          ],
        },
        {
          id: 5,
          activityId: 41,
          text: '영상만들기',
          detail: '사진만 찍어도 의미가 있는데 그 순간들을 영상으로 남기면 어떨까요? 생생한 추억이 더 오래갈 거예요. 😊 영상을 만드는 것은 어렵지 않아요. 심지어 핸드폰으로도 고퀄리티의 영상들을 만들 수 있어요. 담고 싶은 순간을 영상으로 남기세요. 그리고 나중에 그것들을 영상편집 프로그램으로 가볍게 붙여보세요. 생각보다 괜찮은 결과물에 놀라실 거예요. 오랜 시간이 지난 후에 봐도 기억에 잘 남겠죠?',
          intro: [
            {
              id: 1, text: '영상 촬영하기',
            },
            {
              id: 2, text: '만화 그리기',
            },
          ],
        },
        {
          id: 6,
          activityId: 42,
          text: '캠핑 가기',
          detail: '캠핑은 날씨가 좋을 때 즐기기 좋은 비타민이에요. 텐트부터 캠핑카까지 다양한 방식으로 즐길 수 있어요. 처음 시작하기에 부담이 된다면 글램핑을 추천해요! 캠핑은 준비물이 많지만 글램핑은 많은 용품들이 준비되어 있어요! 친구들이나 가족들과 하루 바비큐도 구워 먹고 밤하늘도 바라보며 일상의 분위기를 전환해보세요~',
          intro: [
            {
              id: 1, text: '글램핑 가기',
            },
            {
              id: 2, text: '놀이공원 가기',
            },
          ],
        },
      ],
    },
  },
  {
    id: 8,
    text: {
      results: [
        {
          id: 1,
          activityId: 43,
          text: '운동 동호회 가입하기',
          detail: '운동은 같이할수록 더 재미있어요! 즐기고 싶은 운동이 있다면 같은 지역의 사람들과 함께해보세요. ☺ 가벼운 러닝부터 활발한 축구까지 많은 동호회가 있어요. 체육관에 등록하는 것도 하나의 좋은 방법이겠네요. 사람들과 스포츠를 하면서 스포츠맨십도 배우고 사람들도 사귀고! 지금 당장 자신이 좋아하는 스포츠를 다른 사람들과 같이해보세요!',
          intro: [
            {
              id: 1, text: '체육관 등록하기',
            },
            {
              id: 2, text: '새로운 스포츠 배우기',
            },
          ],
        },
        {
          id: 2,
          activityId: 44,
          text: '출사 가기',
          detail: '카메라는 찍는 각도와 시각에 따라 완전히 다른 세상을 보여줘요. 좋아하는 풍경과 사물을 찍으러 다니며 여러분만의 추억을 남겨보세요. 카메라를 구입하는 것이 부담스러우시다면 휴대폰이나 일회용 카메라로 사진을 찍어보세요. 간편하게 휴대폰으로 여러 장을 찍어도 좋고요. 일회용 카메라만의 매력으로 사진을 남겨보세요.',
          intro: [
            {
              id: 1, text: '일회용 카메라로 사진 찍기',
            },
            {
              id: 2, text: '나들이 가기',
            },
          ],
        },
        {
          id: 3,
          activityId: 45,
          text: '전시회 가기',
          detail: '국내에도 유명한 외국 화가들의 전시회가 주기적으로 열리는 것을 알고 계셨나요? 평소 좋아하던 작품이 있다면 미술관에 가보시는 것을 추천해요. 좋아하는 친구들과 같이 가서 멋있는 그림들도 보고요. 서로 사진을 찍어주고 맛있는 음식도 드시고 오세요! 좋은 시간이 되겠어요. 😊 무료 전시회도 많으니 편하게 문화생활을 즐겨보세요.',
          intro: [
            {
              id: 1, text: '박물관 가기',
            },
            {
              id: 2, text: '박람회 가기',
            },
          ],
        },
        {
          id: 4,
          activityId: 46,
          text: '보드게임하기',
          detail: '보드게임을 즐겨 하시나요? 처음 보는 사람들과 어색함을 풀기에도 친목을 쌓기에도 보드게임은 많은 도움이 되어요! 머리를 쓰는 게임, 순발력이 필요한 게임, 협력하는 게임 등 다양한 종류의 보드게임이 있어서 입맛대로 골라서 즐길 수 있어요. 친구들과 새로운 즐길 거리를 찾고 계신다면 보드게임 카페에 가보세요!',
          intro: [
            {
              id: 1, text: '퍼즐 맞추기',
            },
            {
              id: 2, text: '체스 배우기',
            },
          ],
        },
        {
          id: 5,
          activityId: 47,
          text: '당일치기 여행 가기',
          detail: '차가 있다면 여행이 더 쉽겠지만 대중교통으로도 당일치기 여행을 다녀올 수 있어요. 당일치기 여행은 준비물이 많이 필요 없어서 가볍게 출발하기 좋아요. 혼자서 가보시는 건 어떤가요? 활동적인 하루하루 속에서 여유를 느낄 수 있는 좋은 기회일 것 같아요. 좋아하는 음악과 함께라면 더 좋겠네요! 당일로 다녀올 수 있는 여행지로는 강화도, 춘천을 추천드려요!',
          intro: [
            {
              id: 1, text: '국내여행 투어 이용하기',
            },
            {
              id: 2, text: '유적지 가기',
            },
          ],
        },
        {
          id: 6,
          activityId: 48,
          text: '봉사활동하기',
          detail: '봉사활동으로 아름다운 마음을 전달해보세요. 주변 사람들에게 다양한 도움을 줄 수 있어요. 봉사활동은 사람들에게도 도움이 되지만 나의 자존감을 채워주는 활동이기도 해요. 내가 세상에 도움이 되는 사람이라는 생각을 갖게 해주고 나의 가치를 인정받을 수 있거든요. 😊 연탄 배달부터 헌혈까지 세상 사람들에게 사랑을 베풀어주세요. 마음도 행복해지고 좋은 추억도 만들게 될 거예요.',
          intro: [
            {
              id: 1, text: '재능기부하기',
            },
            {
              id: 2, text: '멘토링 참여하기',
            },
          ],
        },
      ],
    },
  },
];

export default resultData;
